app/controllers/login_controller.rb

SELECT * FROM `users` WHERE (user_name = 'guest3') LIMIT 1
---
  def perform_login

    @user = User.find(:first, :conditions => ["user_name = ?", params[:user][:user_name]])