app/controllers/users_controller.rb

def update
  @user = User.find(params[:id])

  respond_to do |format|
    if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `updated_at` = '2012-12-14 10:41:01', `email` = 'new_email@gmail.com' WHERE `id` = 1

def create
    @user = User.new(params[:user])
    @user.salt = @user.generate_salt
    @user.password = @user.encrypt_password(params[:user][:password])
    @user.password_confirmation = @user.encrypt_password(params[:user][:password_confirmation])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`user_type`, `user_name`, `salt`, `updated_at`, `password`, `created_at`, `birthdate`, `first_name`, `last_name`, `phone_number`, `email`) VALUES('guest', 'rashmi', 'eGPsiFNdT38=', '2012-12-07 07:23:54', 'ddf4dcec93ca0d04995f3b8c99b1503acb4bea0191ad4c973bd129c8d60dd0bf', '2012-12-07 07:23:54', NULL, NULL, NULL, NULL, 'rashmi.agarwal@in.v2solutions.com')